from typing import Literal

# ================ Enums ================
DriveTypeEnum = Literal["Передний", "Задний", "Полный", "4x4"]
TransmissionEnum = Literal["Механика", "Автомат", "Вариатор", "Робот"]
FuelTypeEnum = Literal["Бензин", "Дизель", "Электро", "Гибрид"]
SteeringSideEnum = Literal["Левый", "Правый"]
CarConditionEnum = Literal["Новый", "Б/У", "После ремонта", "Повреждённый", "На запчасти"]
BodyTypeEnum = Literal[
    "Седан", "Хэтчбек", "Лифтбек", "Внедорожник", "Кроссовер", "Купе", "Кабриолет",
    "Универсал", "Минивэн", "Фургон", "Пикап", "Родстер", "Лимузин", "Тарга",
    "Фастбэк", "Микрокар"
]